# GetIsFilterEnabled Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
View..::..GetIsFilterEnabled Method
View Class See Also
---
Identifies if the filter is enabled in this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool GetIsFilterEnabled(
	ElementId filterElementId
)
```

Visual Basic
---
```text
Public Function GetIsFilterEnabled ( _
	filterElementId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool GetIsFilterEnabled(
	ElementId^ filterElementId
)
```

# ### Parameters
filterElementId
    Type: Autodesk.Revit.DB..::..ElementId The ElementId of the filter.
# ### Return Value
True if the specified filter is enabled in this view, false otherwise.
# Remarks
Several filters can be applied to a view in a certain order. This enable/disable flag allows one to quickly turn on/off the action of a particular filter in this view (without removing the filter from the set of applied filters and losing the corresponding overrides). By default, all the filters applied to a view are enabled.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Filter is not applied to the view. -or- ElementId is not associated with a FilterElement. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | View does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

# See Also
View Class
Autodesk.Revit.DB Namespace